cherry-embedded/CherryUSB/port/ch582/usb_ch582_reg.h
/* Special Program Space */
#define DATA_FLASH_ADDR     0x70000                   // start address of Data-Flash
#define DATA_FLASH_SIZE     0x8000                    // size of Data-Flash
#define BOOT_LOAD_ADDR      0x78000                   // start address of boot loader program
#define BOOT_LOAD_SIZE      0x6000                    // size of boot loader program
#define BOOT_LOAD_CFG       0x7E000                   // start address of configuration information for boot loader program
#define ROM_CFG_ADDR        0x7F000                   // chip configuration information address

/*----- Reference Information --------------------------------------------*/
#define ID_CH583            0x83                      // chip ID
#define ID_CH582            0x82                      // chip ID
#define ID_CH581            0x81                      // chip ID

/* Interrupt routine address and interrupt number */
#define INT_ID_TMR0         16                        // interrupt number for Timer0
#define INT_ID_GPIO_A       17                        // interrupt number for GPIO port A
#define INT_ID_GPIO_B       18                        // interrupt number for GPIO port B
#define INT_ID_SPI0         19                        // interrupt number for SPI0
#define INT_ID_BLEB         20                        // interrupt number for BLEBB
#define INT_ID_BLEL         21                        // interrupt number for BLELLE
#define INT_ID_USB          22                        // interrupt number for USB
#define INT_ID_USB2         23                        // interrupt number for USB2
#define INT_ID_TMR1         24                        // interrupt number for Timer1
#define INT_ID_TMR2         25                        // interrupt number for Timer2
#define INT_ID_UART0        26                        // interrupt number for UART0
#define INT_ID_UART1        27                        // interrupt number for UART1
#define INT_ID_RTC          28                        // interrupt number for RTC
#define INT_ID_ADC          29                        // interrupt number for ADC and TouchKey
#define INT_ID_I2C          30                        // interrupt number for I2C
#define INT_ID_PWMX_SPI1    31                        // interrupt number for PWM4~11 and SPI1
#define INT_ID_TMR3         32                        // interrupt number for Timer3
#define INT_ID_UART2        33                        // interrupt number for UART2
#define INT_ID_UART3        34                        // interrupt number for UART3
#define INT_ID_WDOG_BAT     35                        // interrupt number for Watch-Dog timer and Battery low voltage
#define INT_VEC_ENTRY_SZ    4                         // size of each interrupt vector entry
#define INT_ADDR_TMR0       (INT_ID_TMR0*INT_VEC_ENTRY_SZ)    // interrupt vector address for Timer0
#define INT_ADDR_GPIO_A     (INT_ID_GPIO_A*INT_VEC_ENTRY_SZ)  // interrupt vector address for GPIO port A
#define INT_ADDR_GPIO_B     (INT_ID_GPIO_B*INT_VEC_ENTRY_SZ)  // interrupt vector address for GPIO port B
#define INT_ADDR_SPI0       (INT_ID_SPI0*INT_VEC_ENTRY_SZ)    // interrupt vector address for SPI0
#define INT_ADDR_BLEB       (INT_ID_BLEB*INT_VEC_ENTRY_SZ)    // interrupt vector address for BLEBB
#define INT_ADDR_BLEL       (INT_ID_BLEL*INT_VEC_ENTRY_SZ)    // interrupt vector address for BLELLE
#define INT_ADDR_USB        (INT_ID_USB*INT_VEC_ENTRY_SZ)     // interrupt vector address for USB
#define INT_ADDR_USB2       (INT_ID_USB2*INT_VEC_ENTRY_SZ)    // interrupt vector address for USB2
#define INT_ADDR_TMR1       (INT_ID_TMR1*INT_VEC_ENTRY_SZ)    // interrupt vector address for Timer1
#define INT_ADDR_TMR2       (INT_ID_TMR2*INT_VEC_ENTRY_SZ)    // interrupt vector address for Timer2
#define INT_ADDR_UART0      (INT_ID_UART0*INT_VEC_ENTRY_SZ)   // interrupt vector address for UART0
#define INT_ADDR_UART1      (INT_ID_UART1*INT_VEC_ENTRY_SZ)   // interrupt vector address for UART1
#define INT_ADDR_RTC        (INT_ID_RTC*INT_VEC_ENTRY_SZ)     // interrupt vector address for RTC
#define INT_ADDR_ADC        (INT_ID_ADC*INT_VEC_ENTRY_SZ)     // interrupt vector address for ADC and TouchKey
#define INT_ADDR_I2C        (INT_ID_I2C*INT_VEC_ENTRY_SZ)     // interrupt vector address for I2C
#define INT_ADDR_PWMX_SPI1  (INT_ID_PWMX_SPI1*INT_VEC_ENTRY_SZ) // interrupt vector address for PWM4~11 and SPI1
#define INT_ADDR_TMR3       (INT_ID_TMR3*INT_VEC_ENTRY_SZ)    // interrupt vector address for Timer3
#define INT_ADDR_UART2      (INT_ID_UART2*INT_VEC_ENTRY_SZ)   // interrupt vector address for UART2
#define INT_ADDR_UART3      (INT_ID_UART3*INT_VEC_ENTRY_SZ)   // interrupt vector address for UART3
#define INT_ADDR_WDOG_BAT   (INT_ID_WDOG_BAT*INT_VEC_ENTRY_SZ) // interrupt vector address for Watch-Dog timer and Battery low voltage

#ifndef TABLE_IRQN
#define __PFIC_PRIO_BITS          2 /*!< uses 8 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig    0 /*!< Set to 1 if different SysTick Config is used */
typedef enum IRQn
{
  Reset_IRQn                    = 1,
  NMI_IRQn                      = 2,      /*!<  Non Maskable Interrupt   */
  EXC_IRQn                      = 3,      /*!<  Exceptions Interrupt     */
  SysTick_IRQn                  = 12,	  /*!<  System timer Interrupt  */
  SWI_IRQn                      = 14,     /*!<  software Interrupt */
  TMR0_IRQn                     = 16,
  GPIO_A_IRQn                   = 17,
  GPIO_B_IRQn                   = 18,
  SPI0_IRQn                     = 19,
  BLEB_IRQn                     = 20,
  BLEL_IRQn                     = 21,
  USB_IRQn                      = 22,
  USB2_IRQn                     = 23,
  TMR1_IRQn                     = 24,
  TMR2_IRQn                     = 25,
  UART0_IRQn                    = 26,
  UART1_IRQn                    = 27,
  RTC_IRQn                      = 28,
  ADC_IRQn                      = 29,
  I2C_IRQn                      = 30,
  PWMX_SPI1_IRQn                = 31,
  TMR3_IRQn                     = 32,
  UART2_IRQn                    = 33,
  UART3_IRQn                    = 34,
  WDOG_BAT_IRQn                 = 35
} IRQn_Type;
#endif


#ifdef __cplusplus
}
#endif

#endif  // __CH583SFR_H__


